/* //بتعيد ترتيب الارراي بطريقه عكسيه بحيث الاندكس الاخير يصبح اول اندكس و هكذا 
let arr = ["Banana", "Orange", "Apple", "Mango"];
console.log(arr.reverse());
 */

/* //بجيبلي العنصر الي بدي ياه عن طريق وضع الاندكس داخل الاقواس او []
let arr = [10, 32, 43, 84, 15, 226];
console.log(arr.at(5)); */

/* //دمج المصفوفات مع بعض ايضا بتقدر تدمج عنصر واحد ليس فقط مصفوفه
let arr = [1, 2, 3, 4];
let arr1 = [5, 6, 7, 8, 9];
let arr2 = [10, 20, 30, 40, 50];
console.log(arr.concat(arr1));
console.log(arr.concat(arr1, arr2));
console.log(arr.concat(100));
 */

/* // يتم قطع جزء من المصفوفه بحيث الرقم الاول يشير ال بداية القطه و الرقم الثاني الى نهاية قطع ولكن لا يدخل في عملية القطع
let arr = ["Banana", "Orange", "Apple", "Mango", "Kiwi", "lemon", "potato"];
console.log(arr.slice(0, 2));
console.log(arr.slice(1, 4)); */

/* //هاي طريقه امنه بحيث اعمل تحديث للمصفوفه بدون ما اعمل اي تغيير عللى المصفوفه الاصليه الرقم يشير الى الاندكس و الخانه الثانيه الي بدي اضيفه جديد
let arr = ["Banana", "Orange", "Apple", "Mango"];
console.log(arr.with(2, "kiwi")); */

/* //بعمل تحويل المصفوفه الى سلسله نصيه و بفاصل حسب الي بحدده اليوزر بين العناصر و ال جوين ما بتعدل على المصفوفه الاصليه
let arr = [1, 2, 3, 4];
console.log(arr.join("**"));
 */
